#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`failure`

<details><summary>Show Plan</summary>

```

terraform
data.aws_acm_certificate.domain-cert: Reading...
data.aws_acm_certificate.domain-cert: Still reading... [10s elapsed]
data.aws_acm_certificate.domain-cert: Still reading... [20s elapsed]
data.aws_acm_certificate.domain-cert: Still reading... [30s elapsed]
data.aws_acm_certificate.domain-cert: Still reading... [40s elapsed]
data.aws_acm_certificate.domain-cert: Still reading... [50s elapsed]
data.aws_acm_certificate.domain-cert: Still reading... [1m0s elapsed]
data.aws_acm_certificate.domain-cert: Still reading... [1m10s elapsed]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # aws_cloudfront_origin_access_control.s3-oac will be created
  + resource "aws_cloudfront_origin_access_control" "s3-oac" {
      + arn                               = (known after apply)
      + description                       = "Managed by Terraform"
      + etag                              = (known after apply)
      + id                                = (known after apply)
      + name                              = "default-oac"
      + origin_access_control_origin_type = "s3"
      + signing_behavior                  = "always"
      + signing_protocol                  = "sigv4"
    }

  # aws_s3_bucket.s3-website-bucket will be created
  + resource "aws_s3_bucket" "s3-website-bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_region               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = "us-east-2"
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # aws_s3_bucket_public_access_block.s3-public-access-block will be created
  + resource "aws_s3_bucket_public_access_block" "s3-public-access-block" {
      + block_public_acls       = false
      + block_public_policy     = false
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = false
      + region                  = "us-east-2"
      + restrict_public_buckets = false
    }

  # aws_s3_bucket_website_configuration.s3-website-configuration will be created
  + resource "aws_s3_bucket_website_configuration" "s3-website-configuration" {
      + bucket           = (known after apply)
      + id               = (known after apply)
      + region           = "us-east-2"
      + routing_rules    = (known after apply)
      + website_domain   = (known after apply)
      + website_endpoint = (known after apply)

      + error_document {
          + key = "index.html"
        }

      + index_document {
          + suffix = "index.html"
        }
    }

  # random_uuid.name_uuid will be created
  + resource "random_uuid" "name_uuid" {
      + id     = (known after apply)
      + result = (known after apply)
    }

Plan: 5 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + s3_website_endpoint = (known after apply)

```

</details>

*Pushed by: @ZakariaTalhami, Action: `pull_request`*